<?php
include_once '../Config.php';
include('../partials/header.php');
?>
<link href="../css/publisher.css" rel="stylesheet">


<nav aria-label="breadcrumb">
  <ol class="breadcrumb container">
    <li class="breadcrumb-item"><a href="/eudoxus_site/index.php">Αρχική</a></li>
    <li class="breadcrumb-item"><a href="publisher.php">Εκδότης</a></li>
    <li class="breadcrumb-item active" aria-current="page">Βοήθεια</li>
  </ol>
</nav>

<h3>Διαδικασία Εγγραφής Εκδοτών</h3>
<p>Κάθε εκδοτικός οίκος ή αυτοεκδότης αρχικά θα πρέπει να εγγραφεί και να πιστοποιηθεί προκειμένου να αποκτήσει πρόσβαση στο Κεντρικό Πληροφοριακό Σύστημα (ΚΠΣ), μέσω μιας απλής διαδικασίας, από την <a href="/eudoxus_site/signup.php" target="_blank">ιστοδελίδα εγγραφής</a>.</p>

<a href="#" class="clickable_help" onclick="toggle_visibility('hidden_help');">Οδηγίες σύνδεσης</a>
<div style="display: none;" id="hidden_help">
Αν δεν έχετε δημιουργήσει λογαριασμό,<a href="/eudoxus_site/signup.php" target="_blank">Δημιουργήστε λογαριασμό εκδότη</a></br>
Μεταβείτε στην <a href="/eudoxus_site/login.php" target="_blank">σελίδα εγγραφής</a></br>
</div>


<h3>Διαδικασία Επεξεργασίας Συγγραμμάτων από Εκδοτικούς Οίκους και Αυτοεκδότες</h3>
<p>Κάθε εκδοτικός οίκος ή αυτοεκδότης αφού συνδεθεί στο σύστημα έχει την δυνατότητα επεξεργασίας των παρεχόμενων συγγραμμάτων του,τα οποία αποθηκεύονται στην Κεντρική Βάση Δεδομένων(ΚΒΔ),όπως προσθήκη,αφαίρεση και τροποποίηση στοιχείων για κάποιο σύγγραμμα,μέσω της <a href="publisher2.php" target="_blank">Διαχείρησης Συγγραμμάτων</a>. </p>

<a href="#" class="clickable_help" onclick="toggle_visibility('hidden_help2');">Οδηγίες Διαχείρισης Συγγραμμάτων</a>
<div style="display: none;" id="hidden_help2">
<ol>
  <li>Συνδεθείτε στο σύστημα χρησιμοποιώντας το username και το password που δηλώσατε κατά την εγγραφή σας</li>
  <li>Μεταβείτε στην <a href="eudoxus_site/publisher/publisher2.php" target="_blank">Διαχείρηση Συγγραμμάτων</a></li>
  <li>Αν θέλετε να επεξεργαστείτε τα ήδη προσφερόμενα συγγράμματα,έχετε την δυνατότητα αφαίρεσης συγγράμματος ή επεξεργασίας των δηλωθέντων στοιχείων του</li>
  <li>Αν θέλετε να προσθέσετε ένα σύγγραμμα ακολουθήστε τα παρακάτω βήματα</li>
  <ol>
    <li>Επιλέξτε την επιλογή <strong>Προσθήκη Συγγράμματος</strong></li>
    <li>Συμπληρώστε τα πεδία:</li>
    <ul style="list-style-type:disc">
      <li>Τίτλος</li>
      <li>ISBN</li>
      <li>Συγγραφέας</li>
      <li>Κατηγορία</li>
      <li>Διαθέσιμα Αντίτυπα</li>
    </ul>
    <li>Πατήστε <strong>Προσθήκη</strong> για να καταχωρηθεί το νέο σύγγραμμα</li>
    <li>Πλέον η λίστα σας θα έχει ανανεωθεί και θα περιέχει το σύγγραμμα που προσθέσατε</li>
  </ol>
</ol> 
</div>

<h3>Υπηρεσία Ταχυμεταφοράς</h3>
<p>Κάθε εκδοτικός οίκος ή αυτοεκδότης έχει την δυνατότητα παροχής της υπηρεσίας της ταχυμεταφοράς για την παράδοση των συγγραμμάτων που παρέχει στους φοιτητές</p>
<a href="#" class="clickable_help" onclick="toggle_visibility('hidden_help3');">Οδηγίες Χρήσης Υπηρεσίας Ταχυμεταφοράς</a>
<div style="display: none;" id="hidden_help3">
  <p>Αφού πραγματοποιήσει την <a href="signin" target="_blank">σύνδεση</a>,ο εκδότης μεταβαίνει στην <a href="publisher_courier.html" target="_blank">Υπηρεσία Ταχυμεταφοράς</a>και ακολουθεί τα παρακάτω βήματα. </p>
  <ul>
    <li>Από τη λίστα "Κατάσταση", που βρίσκεται πάνω δεξιά στην σελίδα, μπορεί να επιλέξει μία από τις δυνατές καταστάσεις (Επιλεγμένο από φοιτητή, Προετοιμασία για αποστολή, Παραλήφθηκε από courier, Αναμονή παραλαβής από φοιτητή, Παραδόθηκε σε φοιτητή, Επιστράφηκε σε εκδότη, Ακυρώθηκε) ή να επιλέξει "ΟΛΕΣ" για να προβάλει όλες τις διανομές με Courier. Πατώντας "Επιλογή" εμφανίζεται η λίστα με τις διανομές με Courier που βρίσκονται στην επιλεγμένη κατάσταση.</li>
    <li> Για κάθε Επιλεγμένο Βιβλίο από φοιτητή φαίνεται ο κωδικός και ο τίτλος του βιβλίου, το ονοματεπώνυμο και ο αριθμός μητρώου του φοιτητή και η κατάσταση της αποστολής.</li>
    <li>Σε περίπτωση που έχει ήδη ξεκινήσει η διαδικασία απόστολής του βιβλίου στο Φοιτητή φαίνεται στην τελευταία στήλη και ο αριθμός του voucher της αποστολής.</li>
    <li>Οι καταχωρίσεις που βρίσκονται σε κατάσταση "Επιλεγμένο από φοιτητή" αναφέρονται σε βιβλία που έχουν επιλεγεί από φοιτητές, στους οποίους θα πρέπει να σταλούν μέσω Courier, και εκκρεμεί να εκκινήσει η διαδικασία αποστολής τους από το χρήστη.</li>
    <li>Σημειώνεται ότι εφ' όσον δεν έχει εκκινήσει η διαδικασία αποστολής τους είναι στη διακριτική ευχέρεια του φοιτητή να αλλάξει την επιλογή του συγκεκριμένου βιβλίου.</li>
    <li> Για να εκκινήσει τη διαδικασία αποστολής κάποιου/ων βιβλίου/ων, ο χρήστης θα πρέπει να επιλέξει το βιβλίο/βιβλία (πατώντας πάνω τους διαδοχικά) και στη συνέχεια να πατήσει το κουμπί "Εναρξη Αποστολής των Επιλεγμένων Βιβλίων".</li>
    <li>Αυτομάτως, η κατάσταση των επιλεγμένων βιβλίων θα αλλάξει σε "Προετοιμασία για αποστολή". Σημειώνεται ότι από τη στιγμή αυτή η επιλογή του φοιτητή οριστικοποιείται.</li>

  </ul>
  <p>Αφού ολοκληρωθούν τα παραπάνω βήματα, ο εκδότης πρέπει να προχωρήσει στα παρακάτω βήματα εκτύπωσης και συσκευασίας πριν την παράδοση των συγγραμμάτων στο υποκατάστημα της εταιρείας Courier.</p>
  <ul>
    <li> Για τις καταχωρίσεις που βρίσκονται σε κατάσταση "Προετοιμασία για αποστολή", θα πρέπει να πραγματοποιηθούν οι εξής ενέργειες, προκειμένου να προχωρήσει η διαδικασία αποστολής των αντίστοιχων βιβλίων στους φοιτητές:
    </li>
      <ol>
      <li>Κάθε βιβλίο θα πρέπει να συσκευαστεί ξεχωριστά σε ειδική νάυλον συσκευασία.</li>
      <li>Ο χρήστης, αφού επιλέξει μία ή περισσότερες καταχωρίσεις (από αυτές που βρίσκονται σε κατάσταση "Προετοιμασία για αποστολή), επιλέγει "Εκτύπωση Ετικετών", οπότε και εξάγεται ένα αρχείο PDF το οποίο περιλαμβάνει τις ετικέτες αποστολής (voucher) για τους φοιτητές που έχουν επιλεγεί (μέχρι 3 ετικέτες ανά σελίδα, κάθε μία εκ των οποίων αναγράφει τα απαραίτητα στοιχεία για την αποστολή ενός εκ των επιλεγμένων βιβλίων). Ο χρήστης θα πρέπει να εκτυπώσει το αρχείο αυτό και να επικολλήσει κατάλληλα την κάθε ετικέτα στο βιβλίο στο οποίο αντιστοιχεί.</li>
      <li>Τέλος, ο χρήστης θα πρέπει να παραδόσει τα συσκευασμένα βιβλία στο υποκατάστημα της εταιρείας Courier με το οποίο συνεργάζεται.</li>
      </ol>
    <li> Ακολούθως, ο χρήστης θα μπορεί να ενημερώνεται από τη στήλη "Κατάσταση" σε ποιο στάδιο βρίσκεται η κάθε αποστολή.</li>
  </ul>
  <p>Τηλέφωνο επικοινωνίας με την εταιρεία Courier (ACS): 801 - 500 - 1111</p>
  </div>
  </br>    </br>
    </br>

<?php
   include('../partials/footer.html');
?>

<script type="text/javascript">
    function toggle_visibility(id) {
       var e = document.getElementById(id);
       if(e.style.display == 'block')
          e.style.display = 'none';
       else
          e.style.display = 'block';
    }
</script>
